package lesson_2;
/*
Написать метод, которому в качестве параметра передается целое число. Метод должен вернуть true, если
отрицательное, и вернуть false если положительное. Значение: ноль считаем положительным числом
 */

public class SeventhTask {
    public static void main(String[] args) {
        int a = -1;
        integer(a);
    }

    static void integer(int x) {

            System.out.println(x < 0 && x <= 0);

    }
}

